In [73]:
!ls

cleaned_data.csv  sample_data  tested.csv

In [74]:
import pandas as pd
import numpy as np
df = pd.read_csv("tested.csv")   # change name if needed
df.head()
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Survived     418 non-null    int64
 2   Pclass       418 non-null    int64
 3   Name         418 non-null    object
 4   Sex          418 non-null    object
 5   Age          332 non-null    float64
 6   SibSp        418 non-null    int64
 7   Parch        418 non-null    int64
 8   Ticket       418 non-null    object
 9   Fare         417 non-null    float64
 10  Cabin        91 non-null     object
 11  Embarked     418 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 39.3+ KB

In [75]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [76]:
df['Age'] = df['Age'].fillna(df['Age'].mean())
df['Embarked'] = df['Embarked'].fillna(df['Embarked'].mode()[0])
df.drop_duplicates(inplace=True)

In [77]:
df['Age'] = df['Age'].astype(int)

In [78]:
df['Age_Group'] = pd.cut(
    df['Age'],
    bins=[0,12,20,40,60,100],
    labels=['Child','Teen','Adult','Middle','Senior']
)

In [79]:
df.to_csv("cleaned_data.csv", index=False)

### Data Cleaning Steps
- Checked dataset structure using `.info()`
- Identified missing values using `.isnull().sum()`
- Filled numeric values using mean
- Filled categorical values using mode
- Removed duplicate rows
- Converted data types for accurate analysis
- Created new derived column for better insights